# Standard Installs
brew "colima"
brew "ddev"
brew "docker"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "jq"
brew "mkcert"
brew "nvm"
brew "stripe/stripe-cli/stripe"

# Other Taps
# ...

# Cask-based Installs

cask_args appdir: "~/Applications"

cask "1password"
cask "adobe-creative-cloud"
cask "discord"
cask "dropbox"
cask "firefox"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "ngrok"
cask "phpstorm"
cask "slack"
cask "tableplus"
cask "tower"
cask "visual-studio-code"
cask "vlc"

# App Store

mas "Wipr", id: 1320666476
mas "Little Ipsum", id: 405772121

# Fonts

tap "homebrew/cask-fonts"
cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "font-ia-writer-mono"
cask "font-sf-mono"
