# Standard Installs
brew "colima"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "git"
brew "jq"
brew "mkcert"
brew "node"
brew "stripe/stripe-cli/stripe"

# Other Taps
tap "ddev/ddev"
brew "ddev"

# Cask-based Installs

cask_args appdir: "~/Applications"

cask "1password"
cask "adobe-creative-cloud"
cask "discord"
cask "dropbox"
cask "firefox"
cask "front"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "keybase"
cask "linear-linear"
cask "minecraft"
cask "monitorcontrol"
cask "ngrok"
cask "notion"
cask "phpstorm"
cask "protonvpn"
cask "raycast"
cask "signal"
cask "slack"
cask "tableplus"
cask "tower"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "zoom"

# App Store

mas "Wipr 2", id: 1662217862
mas "Tiny Ipsum", id: 1445179392

# Fonts

cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "font-ia-writer-mono"
cask "font-sf-mono"
cask "font-geist"
cask "font-geist-mono"
