# Standard Installs
brew "fish"
brew "colima"
brew "gh"
brew "mkcert"
brew "ffmpeg"
brew "docker"

# Other Taps
tap "drud/ddev"
brew "drud/ddev/ddev"

# Cask-based Installs

cask_args appdir: "~/Applications", greedy: true

cask "firefox"
cask "google-chrome"
cask "dropbox"
cask "visual-studio-code"
cask "discord"
cask "slack"
cask "github"
cask "iterm2"
cask "phpstorm"
cask "1password"
cask "ngrok"
cask "tableplus"
cask "tower"

# App Store

mas "Wipr", id: 1320666476

# Fonts

tap "homebrew/cask-fonts"
cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "font-ia-writer-mono"
cask "font-sf-mono"
